In [13]:
#像stock這種每天都在變化的東西 很容易會出現missing data
#透過pandas處理missing data and fill

import numpy as np
import pandas as pd

d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [2]:
df = pd.DataFrame(d)

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [10]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [11]:
df.fillna(value = 'fill')

      A     B  C
0     1     5  1
1     2  fill  2
2  fill  fill  3

In [12]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [37]:
#GroupBy 是可以用ＩＤ來快速分群的
data = {'Company':['GooG','GooG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Leo','KC','Kayson','Mingle','Mickey'],
        'Sales':[200,120,340,124,243,359]}

In [39]:
df2 = pd.DataFrame(data)
df2

  Company  Person  Sales
0    GooG     Sam    200
1    GooG     Leo    120
2    MSFT      KC    340
3    MSFT  Kayson    124
4      FB  Mingle    243
5      FB  Mickey    359

In [35]:
bycomp = df2.groupby('Company') #如何知道group name有誰
bycomp.head()['Company']

0    GooG
1    GooG
2    MSFT
3    MSFT
4      FB
5      FB
Name: Company, dtype: object

In [19]:
bycomp.sum()

         Sales
Company
FB         602
GooG       320
MSFT       464

In [20]:
bycomp.std()

              Sales
Company
FB        82.024387
GooG      56.568542
MSFT     152.735065

In [22]:
bycomp.sum().loc['FB']

Sales    602
Name: FB, dtype: int64

In [24]:
bycomp.count()

         Person  Sales
Company
FB            2      2
GooG          2      2
MSFT          2      2

In [25]:
bycomp.min()

         Person  Sales
Company
FB       Mickey    243
GooG        Leo    120
MSFT         KC    124

In [27]:
df2.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
FB        2.0  301.0   82.024387  243.0  272.0  301.0  330.0  359.0
GooG      2.0  160.0   56.568542  120.0  140.0  160.0  180.0  200.0
MSFT      2.0  232.0  152.735065  124.0  178.0  232.0  286.0  340.0

In [28]:
df2.groupby('Company').describe().transpose()

Company              FB        GooG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   301.000000  160.000000  232.000000
      std     82.024387   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    272.000000  140.000000  178.000000
      50%    301.000000  160.000000  232.000000
      75%    330.000000  180.000000  286.000000
      max    359.000000  200.000000  340.000000

In [29]:
df2.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     301.000000
       std       82.024387
       min      243.000000
       25%      272.000000
       50%      301.000000
       75%      330.000000
       max      359.000000
Name: FB, dtype: float64